# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [43]:
# enter your code here
orders = pd.read_csv("../../lab-subsetting-and-descriptive-stats/your-code/Orders.csv")
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [9]:
customers = orders.groupby("CustomerID").agg({"amount_spent":'sum'})
customers.sort_values("amount_spent", ascending=False)[:10]

            amount_spent
CustomerID
14646          280206.02
18102          259657.30
17450          194550.79
16446          168472.50
14911          143825.06
12415          124914.53
14156          117379.63
17511           91062.38
16029           81024.84
12346           77183.60

In [24]:
customers["amount_spent"].describe() #to get an idea of the data

count      4339.000000
mean       2053.793018
std        8988.248381
min           0.000000
25%         307.245000
50%         674.450000
75%        1661.640000
max      280206.020000
Name: amount_spent, dtype: float64

In [25]:
n95 = np.percentile(customers["amount_spent"], 95) #95 percentile
n95

5840.181999999983

In [27]:
n75 = np.percentile(customers["amount_spent"], 75) #75 percentile
n75

1661.6400000000003

In [34]:
VIP = customers[customers["amount_spent"] > n95]
VIP.sort_values("amount_spent", ascending=False)[:10]

            amount_spent
CustomerID
14646          280206.02
18102          259657.30
17450          194550.79
16446          168472.50
14911          143825.06
12415          124914.53
14156          117379.63
17511           91062.38
16029           81024.84
12346           77183.60

In [36]:
preferred = customers[(customers["amount_spent"] < n95) & (customers["amount_spent"] >n75)]
preferred.sort_values("amount_spent", ascending=False)[:10]

            amount_spent
CustomerID
13050            5836.86
12720            5781.73
15218            5756.89
17686            5739.46
13178            5725.47
16553            5719.82
13468            5704.97
14110            5683.15
14049            5681.72
17049            5659.98

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

In [40]:
VIP["Country"] = orders["Country"]

c:\users\regi_\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [75]:
VIP_country = VIP.groupby("Country").count().sort_values('amount_spent', ascending=False)
VIP_country.rename({'amount_spent' :'VIP Customers'}, axis='columns', inplace=True)
VIP_country
#these countries have the most VIP customers, UK being the leader.

                VIP Customers
Country
United Kingdom            191
France                      6
Germany                     6
Norway                      6
EIRE                        3
Portugal                    2
Spain                       2
Japan                       1

In [86]:
preferred["Country"] = orders["Country"]
preferred_country = preferred.groupby("Country").count().sort_values('amount_spent', ascending=False)
preferred_country.rename({'amount_spent' :'Preferred Customers'}, axis='columns', inplace=True)
preferred_country

c:\users\regi_\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

                 Preferred Customers
Country
United Kingdom                   780
Norway                            18
Germany                           16
France                            13
Spain                             13
EIRE                               9
Denmark                            8
Japan                              5
Portugal                           4
Channel Islands                    2

In [87]:
both = pd.merge(VIP_country, preferred_country, on='Country')
both

                VIP Customers  Preferred Customers
Country
United Kingdom            191                  780
France                      6                   13
Germany                     6                   16
Norway                      6                   18
EIRE                        3                    9
Portugal                    2                    4
Spain                       2                   13
Japan                       1                    5

In [91]:
both["VIP+Preferred"] = both["VIP Customers"] + both["Preferred Customers"]
both.sort_values('VIP+Preferred', ascending=False)
#UK has the highest number of VIP+Preferred Customers

                VIP Customers  Preferred Customers  VIP+Preferred
Country
United Kingdom            191                  780            971
Norway                      6                   18             24
Germany                     6                   16             22
France                      6                   13             19
Spain                       2                   13             15
EIRE                        3                    9             12
Portugal                    2                    4              6
Japan                       1                    5              6